10/data/attachments/1967659809e2ebd9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Jeremy_hair_Friend_45705_7</nif:username>
            <nif:friendToBeRequested>soap_friends_a0190080-e586-4dc7-b364-b59b2cc15082</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>